from pathlib import Path

path = Path("./districts")

subjects = {
    "1": "Водоснабжение",
    "2": "Водоснабжение. Горячая вода",
    "3": "Водоснабжение. Холодная вода",
    "4": "Отопление",
    "5": "Канализация",
    "6": "Техническое обслуживание лифта",
    "7": "Техническое обслуживание ЗПУ",
    "9": "Общестроительные работы",
    "10": "Бытовые услуги",
    "11": "Электроснабжение",
    "12": "Санитарное состояние и благоустройство территории",
    "13": "Санитарное состояние многоквартирного дома",
    "14": "Кровельные работы",
    "15": "Работы по ремонту стыков",
    "16": "Автомобильные дороги, тротуары",
    "17": "Общественные места (Парки, скверы)",
    "18": "Общественный транспорт, остановки общественного транспорта",
    "19": "Рекламные и информационные конструкции и объявления",
    "20": "Другое",
    "22": "Техническое обслуживание зданий и сооружений",
    "23": "Обращение с ТКО",
    "24": "Газоснабжение",
}

list_of_dates_2020 = [
    # "Суббота, 01 Февраль, 2020",
    "Воскресенье, 01 Март, 2020",
    "Среда, 01 Апрель, 2020",
    "Пятница, 01 Май, 2020",
    "Понедельник, 01 Июнь, 2020",
    "Среда, 01 Июль, 2020",
    "Суббота, 01 Август, 2020",
    "Вторник, 01 Сентябрь, 2020",
    "Четверг, 01 Октябрь, 2020",
    "Воскресенье, 01 Ноябрь, 2020",
    "Вторник, 01 Декарь, 2020",
]

url = "https://115.xn--90ais/portal/wwv_flow.ajax"
# dymanic params for header:
cookie = "OracleMapsPlugin_R761175865244051364_7119351139895=16#3088804855624837#7158895191585507#3857; PORTAL_USER_TOKEN=A1D77B502D160AE2C3873E6B39E222D5D0ED10354CDFA10DFAF2A65DF50717F353B04BD473619F3DC851F6A2F94A7F16ED92CA18B54C49758005B5A7EBFC0699; OracleMapsPlugin_R761175865244051364_11018758419082=16#3121932443289751#7171117959163840#3857; ORA_WWV_APP_10901=ORA_WWV-u1YCkIOAGSnp3yaHnj8xyCCa; ORA_WWV_RAC_INSTANCE=2; ai_user=yIAIFgz6SRFD8GLE51HHnU|2022-11-02T09:35:41.515Z"
referer = (
    "https://115.xn--90ais/portal/f?p=10901:REQUESTS_MAP:115927250491320::NO:::"
)


week_days = {
        "1": "Понедельник",
        "2": "Вторник",
        "3": "Среда",
        "4": "Четверг",
        "5": "Пятница",
        "6": "Суббота",
        "0": "Воскресенье",
    }

months_translate = {
    "January": "Январь",
    "February": "Февраль",
    "March": "Март",
    "April": "Апрель",
    "May": "Май",
    "June": "Июль",
    "July": "Июль",
    "August": "Август",
    "September": "Сентябрь",
    "October": "Октябрь",
    "November": "Ноябрь",
    "December": "Декарь",
}

