from pathlib import Path

path = Path("./districts")

subjects = {
    "1": "Водоснабжение",
    "2": "Водоснабжение. Горячая вода",
    "3": "Водоснабжение. Холодная вода",
    "4": "Отопление",
    "5": "Канализация",
    "6": "Техническое обслуживание лифта",
    "7": "Техническое обслуживание ЗПУ",
    "9": "Общестроительные работы",
    "10": "Бытовые услуги",
    "11": "Электроснабжение",
    "12": "Санитарное состояние и благоустройство территории",
    "13": "Санитарное состояние многоквартирного дома",
    "14": "Кровельные работы",
    "15": "Работы по ремонту стыков",
    "16": "Автомобильные дороги, тротуары",
    "17": "Общественные места (Парки, скверы)",
    "18": "Общественный транспорт, остановки общественного транспорта",
    "19": "Рекламные и информационные конструкции и объявления",
    "20": "Другое",
    "22": "Техническое обслуживание зданий и сооружений",
    "23": "Обращение с ТКО",
    "24": "Газоснабжение",
}

list_of_dates_2020 = [
    # "Суббота, 01 Февраль, 2020",
    "Воскресенье, 01 Март, 2020",
    "Среда, 01 Апрель, 2020",
    "Пятница, 01 Май, 2020",
    "Понедельник, 01 Июнь, 2020",
    "Среда, 01 Июль, 2020",
    "Суббота, 01 Август, 2020",
    "Вторник, 01 Сентябрь, 2020",
    "Четверг, 01 Октябрь, 2020",
    "Воскресенье, 01 Ноябрь, 2020",
    "Вторник, 01 Декарь, 2020",
]

week_days = {
    "1": "Понедельник",
    "2": "Вторник",
    "3": "Среда",
    "4": "Четверг",
    "5": "Пятница",
    "6": "Суббота",
    "0": "Воскресенье",
}

months_translate = {
    "January": "Январь",
    "February": "Февраль",
    "March": "Март",
    "April": "Апрель",
    "May": "Май",
    "June": "Июль",
    "July": "Июль",
    "August": "Август",
    "September": "Сентябрь",
    "October": "Октябрь",
    "November": "Ноябрь",
    "December": "Декарь",
}
